Revit 2027 API
BuiltInFailures.SketchFailures.OpenBoundaryConditionsLoop Property
 Area Boundary Conditions Sketch can't contain open loops.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OpenBoundaryConditionsLoop { get; }
Public Shared ReadOnly Property OpenBoundaryConditionsLoop As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OpenBoundaryConditionsLoop {
	FailureDefinitionId^ get ();
}
static member OpenBoundaryConditionsLoop : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace